/*
 *
 * 登記送共用JS-多顆登記按鈕版
 * ecchao 2018.05.29
 * 
 */


var registerPromo = 
[
  {
    m_promoNo    : 'M20211016002',                 //主檔代碼
    dt_promoNo   : ['D20211016001','D20211016002'],//明細檔代碼
    gift_code    : ['Gift001','Gift002'],          //獎品檔代碼
    gift_content : {'D20211016001' : '5%momo幣',
                    'D20211016002' : '映峻健身車'},//獎品名稱
    cntType      : '1003',                         //取目前"剩餘"登記人數(指定品登記固定用100599、一般登記固定用1007),取目前登記人數(固定用1003)
    listType     : '1003'                          //取登記紀錄(固定1003)
    //以上兩個Type參數有做防呆，若需要用到其他參數，要先詢問IT，THX
  },
  {
    m_promoNo    : 'M20211016001',                 //主檔代碼
    dt_promoNo   : ['D20211016001','D20211016002','D20211016003','D20211016004'],//明細檔代碼
    gift_code    : ['Gift001','Gift002','Gift003','Gift004'],          //獎品檔代碼
    gift_content : {'D20211016001' : '手機支架',
                    'D20211016002' : '雨衣',
                    'D20211016003' : '按摩槍',
                    'D20211016004' : '雙面睡袋'},//獎品名稱
    cntType      : '100599',                         //取目前"剩餘"登記人數(指定品登記固定用100599、一般登記固定用1007),取目前登記人數(固定用1003)
    listType     : '1003'                          //取登記紀錄(固定1003)
    //以上兩個Type參數有做防呆，若需要用到其他參數，要先詢問IT，THX
  }
]